## Plan Result (prod_video_hearings)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 2 to destroy.</code></pre>

* Update
  * module.subscription[&#34;DTS-VH-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-VH-PROD&#34;].azurerm_key_vault_secret.sp_token
* Replace
  * module.environment[&#34;prod&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-VH-PROD&#34;].azuread_application_password.token




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.environment["prod"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/39e7e661-340b-4cbd-b5b7-88406722eda6" -> (known after apply)
      ~ application_object_id = "39e7e661-340b-4cbd-b5b7-88406722eda6" -> "/applications/39e7e661-340b-4cbd-b5b7-88406722eda6" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-09-28T07:05:11Z" -> (known after apply)
      ~ id                    = "39e7e661-340b-4cbd-b5b7-88406722eda6/password/2cd78058-5189-454a-bcc5-44ca90b97950" -> (known after apply)
      ~ key_id                = "2cd78058-5189-454a-bcc5-44ca90b97950" -> (known after apply)
      ~ start_date            = "2023-09-28T07:05:11Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-VH-PROD"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/0b061088-b2fd-4881-aac7-03672b1a17e9" -> (known after apply)
      ~ application_object_id = "0b061088-b2fd-4881-aac7-03672b1a17e9" -> "/applications/0b061088-b2fd-4881-aac7-03672b1a17e9" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-07-25T07:07:01Z" -> (known after apply)
      ~ id                    = "0b061088-b2fd-4881-aac7-03672b1a17e9/password/f5d91c46-1e77-4500-8e0c-c27134a2e388" -> (known after apply)
      ~ key_id                = "f5d91c46-1e77-4500-8e0c-c27134a2e388" -> (known after apply)
      ~ start_date            = "2023-07-25T07:07:01Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-VH-PROD"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "3c238415-a2f4-467d-a27a-cb5d9246d56e"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["DTS-VH-PROD"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c0d4a44b0ec139a3a5692kv.vault.azure.net/secrets/sp-token/c614f1d82cbd443e9ba735371e5b4aa9"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":99,"Program":"tfcmt","SHA1":"","Target":"prod_video_hearings","Vars":{}} -->